/**
 * Пример работы с простым сенсором звука: сенсор подключен к 
 * одной входной ножке и подает на нее сигнал:
 * 0, если сенсор обнаружил звук,
 * 1, если сенсор звук не слышит.
 */

int SENSOR_PIN = 8;
int LED_PIN = 6;

void setup() {
    // пин сенсора в режим ввода
    pinMode(SENSOR_PIN, INPUT);
    // пин светодиода в режим вывода
    pinMode(LED_PIN, OUTPUT);
}

void loop() {
    // проверяем значение сенсора
    if(digitalRead(SENSOR_PIN) == 0) {
        // сенсор сработал - зажигаем лампочку
        digitalWrite(LED_PIN, 1);
        // и подождем секунду
        delay(1000);
    } else {
        // сенсор не сработал - гасим лампочку
        digitalWrite(LED_PIN, 0);
    }    
}
